garyPenhook/PIC-Assembler/device_includes/pic16f13123.inc
// Register: PIE4
#define PIE4 PIE4
PIE4                                     equ 009Ah
// bitfield definitions
PIE4_CLC1IE_POSN                         equ 0002h
PIE4_CLC1IE_POSITION                     equ 0002h
PIE4_CLC1IE_SIZE                         equ 0001h
PIE4_CLC1IE_LENGTH                       equ 0001h
PIE4_CLC1IE_MASK                         equ 0004h
PIE4_CLC2IE_POSN                         equ 0003h
PIE4_CLC2IE_POSITION                     equ 0003h
PIE4_CLC2IE_SIZE                         equ 0001h
PIE4_CLC2IE_LENGTH                       equ 0001h
PIE4_CLC2IE_MASK                         equ 0008h
PIE4_CLC3IE_POSN                         equ 0004h
PIE4_CLC3IE_POSITION                     equ 0004h
PIE4_CLC3IE_SIZE                         equ 0001h
PIE4_CLC3IE_LENGTH                       equ 0001h
PIE4_CLC3IE_MASK                         equ 0010h
PIE4_CLC4IE_POSN                         equ 0005h
PIE4_CLC4IE_POSITION                     equ 0005h
PIE4_CLC4IE_SIZE                         equ 0001h
PIE4_CLC4IE_LENGTH                       equ 0001h
PIE4_CLC4IE_MASK                         equ 0020h
PIE4_TX1IE_POSN                          equ 0006h
PIE4_TX1IE_POSITION                      equ 0006h
PIE4_TX1IE_SIZE                          equ 0001h
PIE4_TX1IE_LENGTH                        equ 0001h
PIE4_TX1IE_MASK                          equ 0040h
PIE4_RC1IE_POSN                          equ 0007h
PIE4_RC1IE_POSITION                      equ 0007h
PIE4_RC1IE_SIZE                          equ 0001h
PIE4_RC1IE_LENGTH                        equ 0001h
PIE4_RC1IE_MASK                          equ 0080h

// Register: PIE5
#define PIE5 PIE5
PIE5                                     equ 009Bh
// bitfield definitions
PIE5_SSP1IE_POSN                         equ 0002h
PIE5_SSP1IE_POSITION                     equ 0002h
PIE5_SSP1IE_SIZE                         equ 0001h
PIE5_SSP1IE_LENGTH                       equ 0001h
PIE5_SSP1IE_MASK                         equ 0004h
PIE5_BCL1IE_POSN                         equ 0003h
PIE5_BCL1IE_POSITION                     equ 0003h
PIE5_BCL1IE_SIZE                         equ 0001h
PIE5_BCL1IE_LENGTH                       equ 0001h
PIE5_BCL1IE_MASK                         equ 0008h
PIE5_CM1IE_POSN                          equ 0006h
PIE5_CM1IE_POSITION                      equ 0006h
PIE5_CM1IE_SIZE                          equ 0001h
PIE5_CM1IE_LENGTH                        equ 0001h
PIE5_CM1IE_MASK                          equ 0040h
PIE5_CM2IE_POSN                          equ 0007h
PIE5_CM2IE_POSITION                      equ 0007h
PIE5_CM2IE_SIZE                          equ 0001h
PIE5_CM2IE_LENGTH                        equ 0001h
PIE5_CM2IE_MASK                          equ 0080h

// Register: PIE6
#define PIE6 PIE6
PIE6                                     equ 009Ch
// bitfield definitions
PIE6_ADIE_POSN                           equ 0000h
PIE6_ADIE_POSITION                       equ 0000h
PIE6_ADIE_SIZE                           equ 0001h
PIE6_ADIE_LENGTH                         equ 0001h
PIE6_ADIE_MASK                           equ 0001h
PIE6_ADTIE_POSN                          equ 0001h
PIE6_ADTIE_POSITION                      equ 0001h
PIE6_ADTIE_SIZE                          equ 0001h
PIE6_ADTIE_LENGTH                        equ 0001h
PIE6_ADTIE_MASK                          equ 0002h

// Register: PIE7
#define PIE7 PIE7
PIE7                                     equ 009Dh
// bitfield definitions
PIE7_CLB1IE0_POSN                        equ 0000h
PIE7_CLB1IE0_POSITION                    equ 0000h
PIE7_CLB1IE0_SIZE                        equ 0001h
PIE7_CLB1IE0_LENGTH                      equ 0001h
PIE7_CLB1IE0_MASK                        equ 0001h
PIE7_CLB1IE1_POSN                        equ 0001h
PIE7_CLB1IE1_POSITION                    equ 0001h
PIE7_CLB1IE1_SIZE                        equ 0001h
PIE7_CLB1IE1_LENGTH                      equ 0001h
PIE7_CLB1IE1_MASK                        equ 0002h
PIE7_CLB1IE2_POSN                        equ 0002h
PIE7_CLB1IE2_POSITION                    equ 0002h
PIE7_CLB1IE2_SIZE                        equ 0001h
PIE7_CLB1IE2_LENGTH                      equ 0001h
PIE7_CLB1IE2_MASK                        equ 0004h
PIE7_CLB1IE3_POSN                        equ 0003h
PIE7_CLB1IE3_POSITION                    equ 0003h
PIE7_CLB1IE3_SIZE                        equ 0001h
PIE7_CLB1IE3_LENGTH                      equ 0001h
PIE7_CLB1IE3_MASK                        equ 0008h

// Register: PMD0
#define PMD0 PMD0
PMD0                                     equ 010Ch
// bitfield definitions
PMD0_NVMMD_POSN                          equ 0000h
PMD0_NVMMD_POSITION                      equ 0000h
PMD0_NVMMD_SIZE                          equ 0001h
PMD0_NVMMD_LENGTH                        equ 0001h
PMD0_NVMMD_MASK                          equ 0001h
PMD0_CRCMD_POSN                          equ 0001h
PMD0_CRCMD_POSITION                      equ 0001h
PMD0_CRCMD_SIZE                          equ 0001h
PMD0_CRCMD_LENGTH                        equ 0001h
PMD0_CRCMD_MASK                          equ 0002h
PMD0_SCANMD_POSN                         equ 0002h
PMD0_SCANMD_POSITION                     equ 0002h
PMD0_SCANMD_SIZE                         equ 0001h
PMD0_SCANMD_LENGTH                       equ 0001h
PMD0_SCANMD_MASK                         equ 0004h
PMD0_SYSCMD_POSN                         equ 0003h
PMD0_SYSCMD_POSITION                     equ 0003h
PMD0_SYSCMD_SIZE                         equ 0001h
PMD0_SYSCMD_LENGTH                       equ 0001h
PMD0_SYSCMD_MASK                         equ 0008h
PMD0_IOCMD_POSN                          equ 0005h
PMD0_IOCMD_POSITION                      equ 0005h
PMD0_IOCMD_SIZE                          equ 0001h
PMD0_IOCMD_LENGTH                        equ 0001h
PMD0_IOCMD_MASK                          equ 0020h
PMD0_TMR0MD_POSN                         equ 0007h
PMD0_TMR0MD_POSITION                     equ 0007h
PMD0_TMR0MD_SIZE                         equ 0001h
PMD0_TMR0MD_LENGTH                       equ 0001h
PMD0_TMR0MD_MASK                         equ 0080h

// Register: PMD1
#define PMD1 PMD1
PMD1                                     equ 010Dh
// bitfield definitions
PMD1_TMR1MD_POSN                         equ 0000h
PMD1_TMR1MD_POSITION                     equ 0000h
PMD1_TMR1MD_SIZE                         equ 0001h
PMD1_TMR1MD_LENGTH                       equ 0001h
PMD1_TMR1MD_MASK                         equ 0001h
PMD1_TMR2MD_POSN                         equ 0002h
PMD1_TMR2MD_POSITION                     equ 0002h
PMD1_TMR2MD_SIZE                         equ 0001h
PMD1_TMR2MD_LENGTH                       equ 0001h
PMD1_TMR2MD_MASK                         equ 0004h
PMD1_CCP1MD_POSN                         equ 0005h
PMD1_CCP1MD_POSITION                     equ 0005h
PMD1_CCP1MD_SIZE                         equ 0001h
PMD1_CCP1MD_LENGTH                       equ 0001h
PMD1_CCP1MD_MASK                         equ 0020h
PMD1_CCP2MD_POSN                         equ 0006h
PMD1_CCP2MD_POSITION                     equ 0006h
PMD1_CCP2MD_SIZE                         equ 0001h
PMD1_CCP2MD_LENGTH                       equ 0001h
PMD1_CCP2MD_MASK                         equ 0040h

