garyPenhook/PIC-Assembler/device_includes/pic16f13123.inc
// Register: IOCCN
#define IOCCN IOCCN
IOCCN                                    equ 01EA6h
// bitfield definitions
IOCCN_IOCCN0_POSN                        equ 0000h
IOCCN_IOCCN0_POSITION                    equ 0000h
IOCCN_IOCCN0_SIZE                        equ 0001h
IOCCN_IOCCN0_LENGTH                      equ 0001h
IOCCN_IOCCN0_MASK                        equ 0001h
IOCCN_IOCCN1_POSN                        equ 0001h
IOCCN_IOCCN1_POSITION                    equ 0001h
IOCCN_IOCCN1_SIZE                        equ 0001h
IOCCN_IOCCN1_LENGTH                      equ 0001h
IOCCN_IOCCN1_MASK                        equ 0002h
IOCCN_IOCCN2_POSN                        equ 0002h
IOCCN_IOCCN2_POSITION                    equ 0002h
IOCCN_IOCCN2_SIZE                        equ 0001h
IOCCN_IOCCN2_LENGTH                      equ 0001h
IOCCN_IOCCN2_MASK                        equ 0004h
IOCCN_IOCCN3_POSN                        equ 0003h
IOCCN_IOCCN3_POSITION                    equ 0003h
IOCCN_IOCCN3_SIZE                        equ 0001h
IOCCN_IOCCN3_LENGTH                      equ 0001h
IOCCN_IOCCN3_MASK                        equ 0008h
IOCCN_IOCCN4_POSN                        equ 0004h
IOCCN_IOCCN4_POSITION                    equ 0004h
IOCCN_IOCCN4_SIZE                        equ 0001h
IOCCN_IOCCN4_LENGTH                      equ 0001h
IOCCN_IOCCN4_MASK                        equ 0010h
IOCCN_IOCCN5_POSN                        equ 0005h
IOCCN_IOCCN5_POSITION                    equ 0005h
IOCCN_IOCCN5_SIZE                        equ 0001h
IOCCN_IOCCN5_LENGTH                      equ 0001h
IOCCN_IOCCN5_MASK                        equ 0020h

// Register: IOCCF
#define IOCCF IOCCF
IOCCF                                    equ 01EA7h
// bitfield definitions
IOCCF_IOCCF0_POSN                        equ 0000h
IOCCF_IOCCF0_POSITION                    equ 0000h
IOCCF_IOCCF0_SIZE                        equ 0001h
IOCCF_IOCCF0_LENGTH                      equ 0001h
IOCCF_IOCCF0_MASK                        equ 0001h
IOCCF_IOCCF1_POSN                        equ 0001h
IOCCF_IOCCF1_POSITION                    equ 0001h
IOCCF_IOCCF1_SIZE                        equ 0001h
IOCCF_IOCCF1_LENGTH                      equ 0001h
IOCCF_IOCCF1_MASK                        equ 0002h
IOCCF_IOCCF2_POSN                        equ 0002h
IOCCF_IOCCF2_POSITION                    equ 0002h
IOCCF_IOCCF2_SIZE                        equ 0001h
IOCCF_IOCCF2_LENGTH                      equ 0001h
IOCCF_IOCCF2_MASK                        equ 0004h
IOCCF_IOCCF3_POSN                        equ 0003h
IOCCF_IOCCF3_POSITION                    equ 0003h
IOCCF_IOCCF3_SIZE                        equ 0001h
IOCCF_IOCCF3_LENGTH                      equ 0001h
IOCCF_IOCCF3_MASK                        equ 0008h
IOCCF_IOCCF4_POSN                        equ 0004h
IOCCF_IOCCF4_POSITION                    equ 0004h
IOCCF_IOCCF4_SIZE                        equ 0001h
IOCCF_IOCCF4_LENGTH                      equ 0001h
IOCCF_IOCCF4_MASK                        equ 0010h
IOCCF_IOCCF5_POSN                        equ 0005h
IOCCF_IOCCF5_POSITION                    equ 0005h
IOCCF_IOCCF5_SIZE                        equ 0001h
IOCCF_IOCCF5_LENGTH                      equ 0001h
IOCCF_IOCCF5_MASK                        equ 0020h

// Register: RC0I2C
#define RC0I2C RC0I2C
RC0I2C                                   equ 01EE9h
// bitfield definitions
RC0I2C_TH_POSN                           equ 0000h
RC0I2C_TH_POSITION                       equ 0000h
RC0I2C_TH_SIZE                           equ 0002h
RC0I2C_TH_LENGTH                         equ 0002h
RC0I2C_TH_MASK                           equ 0003h
RC0I2C_PU_POSN                           equ 0004h
RC0I2C_PU_POSITION                       equ 0004h
RC0I2C_PU_SIZE                           equ 0002h
RC0I2C_PU_LENGTH                         equ 0002h
RC0I2C_PU_MASK                           equ 0030h
RC0I2C_SLEW_POSN                         equ 0006h
RC0I2C_SLEW_POSITION                     equ 0006h
RC0I2C_SLEW_SIZE                         equ 0001h
RC0I2C_SLEW_LENGTH                       equ 0001h
RC0I2C_SLEW_MASK                         equ 0040h

// Register: RC1I2C
#define RC1I2C RC1I2C
RC1I2C                                   equ 01EEAh
// bitfield definitions
RC1I2C_TH_POSN                           equ 0000h
RC1I2C_TH_POSITION                       equ 0000h
RC1I2C_TH_SIZE                           equ 0002h
RC1I2C_TH_LENGTH                         equ 0002h
RC1I2C_TH_MASK                           equ 0003h
RC1I2C_PU_POSN                           equ 0004h
RC1I2C_PU_POSITION                       equ 0004h
RC1I2C_PU_SIZE                           equ 0002h
RC1I2C_PU_LENGTH                         equ 0002h
RC1I2C_PU_MASK                           equ 0030h
RC1I2C_SLEW_POSN                         equ 0006h
RC1I2C_SLEW_POSITION                     equ 0006h
RC1I2C_SLEW_SIZE                         equ 0001h
RC1I2C_SLEW_LENGTH                       equ 0001h
RC1I2C_SLEW_MASK                         equ 0040h

// Register: UMTOAP
#define UMTOAP UMTOAP
UMTOAP                                   equ 01F0Ch
// bitfield definitions
UMTOAP_UMTOAP_POSN                       equ 0000h
UMTOAP_UMTOAP_POSITION                   equ 0000h
UMTOAP_UMTOAP_SIZE                       equ 0008h
UMTOAP_UMTOAP_LENGTH                     equ 0008h
UMTOAP_UMTOAP_MASK                       equ 00FFh

// Register: UMTOAL
#define UMTOAL UMTOAL
UMTOAL                                   equ 01F0Dh
// bitfield definitions
UMTOAL_UMTOAL_POSN                       equ 0000h
UMTOAL_UMTOAL_POSITION                   equ 0000h
UMTOAL_UMTOAL_SIZE                       equ 0008h
UMTOAL_UMTOAL_LENGTH                     equ 0008h
UMTOAL_UMTOAL_MASK                       equ 00FFh

// Register: UMTOAH
#define UMTOAH UMTOAH
UMTOAH                                   equ 01F0Eh
// bitfield definitions
UMTOAH_UMTOAH_POSN                       equ 0000h
UMTOAH_UMTOAH_POSITION                   equ 0000h
UMTOAH_UMTOAH_SIZE                       equ 0008h
UMTOAH_UMTOAH_LENGTH                     equ 0008h
UMTOAH_UMTOAH_MASK                       equ 00FFh

// Register: STATUS_SHAD
#define STATUS_SHAD STATUS_SHAD
STATUS_SHAD                              equ 01FE4h
// bitfield definitions
STATUS_SHAD_STATUS_SHAD_POSN             equ 0000h
STATUS_SHAD_STATUS_SHAD_POSITION         equ 0000h
STATUS_SHAD_STATUS_SHAD_SIZE             equ 0003h
STATUS_SHAD_STATUS_SHAD_LENGTH           equ 0003h
STATUS_SHAD_STATUS_SHAD_MASK             equ 0007h
STATUS_SHAD_STATUS_SHAD0_POSN            equ 0000h
STATUS_SHAD_STATUS_SHAD0_POSITION        equ 0000h
STATUS_SHAD_STATUS_SHAD0_SIZE            equ 0001h
STATUS_SHAD_STATUS_SHAD0_LENGTH          equ 0001h
STATUS_SHAD_STATUS_SHAD0_MASK            equ 0001h
STATUS_SHAD_STATUS_SHAD1_POSN            equ 0001h
STATUS_SHAD_STATUS_SHAD1_POSITION        equ 0001h
STATUS_SHAD_STATUS_SHAD1_SIZE            equ 0001h
STATUS_SHAD_STATUS_SHAD1_LENGTH          equ 0001h
STATUS_SHAD_STATUS_SHAD1_MASK            equ 0002h
STATUS_SHAD_STATUS_SHAD2_POSN            equ 0002h
STATUS_SHAD_STATUS_SHAD2_POSITION        equ 0002h
STATUS_SHAD_STATUS_SHAD2_SIZE            equ 0001h
STATUS_SHAD_STATUS_SHAD2_LENGTH          equ 0001h
STATUS_SHAD_STATUS_SHAD2_MASK            equ 0004h

// Register: WREG_SHAD
#define WREG_SHAD WREG_SHAD
WREG_SHAD                                equ 01FE5h
// bitfield definitions
WREG_SHAD_WREG_SHAD_POSN                 equ 0000h
WREG_SHAD_WREG_SHAD_POSITION             equ 0000h
WREG_SHAD_WREG_SHAD_SIZE                 equ 0008h
WREG_SHAD_WREG_SHAD_LENGTH               equ 0008h
WREG_SHAD_WREG_SHAD_MASK                 equ 00FFh

// Register: BSR_SHAD
#define BSR_SHAD BSR_SHAD
BSR_SHAD                                 equ 01FE6h
// bitfield definitions
BSR_SHAD_BSR_SHAD_POSN                   equ 0000h
BSR_SHAD_BSR_SHAD_POSITION               equ 0000h
BSR_SHAD_BSR_SHAD_SIZE                   equ 0008h
BSR_SHAD_BSR_SHAD_LENGTH                 equ 0008h
BSR_SHAD_BSR_SHAD_MASK                   equ 00FFh

// Register: PCLATH_SHAD
#define PCLATH_SHAD PCLATH_SHAD
PCLATH_SHAD                              equ 01FE7h
// bitfield definitions
PCLATH_SHAD_PCLATH_SHAD_POSN             equ 0000h
PCLATH_SHAD_PCLATH_SHAD_POSITION         equ 0000h
PCLATH_SHAD_PCLATH_SHAD_SIZE             equ 0008h
PCLATH_SHAD_PCLATH_SHAD_LENGTH           equ 0008h
PCLATH_SHAD_PCLATH_SHAD_MASK             equ 00FFh

// Register: FSR0L_SHAD
#define FSR0L_SHAD FSR0L_SHAD
FSR0L_SHAD                               equ 01FE8h
// bitfield definitions
FSR0L_SHAD_FSR0L_SHAD_POSN               equ 0000h
FSR0L_SHAD_FSR0L_SHAD_POSITION           equ 0000h
FSR0L_SHAD_FSR0L_SHAD_SIZE               equ 0008h
FSR0L_SHAD_FSR0L_SHAD_LENGTH             equ 0008h
FSR0L_SHAD_FSR0L_SHAD_MASK               equ 00FFh

// Register: FSR0H_SHAD
#define FSR0H_SHAD FSR0H_SHAD
FSR0H_SHAD                               equ 01FE9h
// bitfield definitions
FSR0H_SHAD_FSR0H_SHAD_POSN               equ 0000h
FSR0H_SHAD_FSR0H_SHAD_POSITION           equ 0000h
FSR0H_SHAD_FSR0H_SHAD_SIZE               equ 0008h
FSR0H_SHAD_FSR0H_SHAD_LENGTH             equ 0008h
FSR0H_SHAD_FSR0H_SHAD_MASK               equ 00FFh

// Register: FSR1L_SHAD
#define FSR1L_SHAD FSR1L_SHAD
FSR1L_SHAD                               equ 01FEAh
// bitfield definitions
FSR1L_SHAD_FSR1L_SHAD_POSN               equ 0000h
FSR1L_SHAD_FSR1L_SHAD_POSITION           equ 0000h
FSR1L_SHAD_FSR1L_SHAD_SIZE               equ 0008h
FSR1L_SHAD_FSR1L_SHAD_LENGTH             equ 0008h
FSR1L_SHAD_FSR1L_SHAD_MASK               equ 00FFh

// Register: FSR1H_SHAD
#define FSR1H_SHAD FSR1H_SHAD
FSR1H_SHAD                               equ 01FEBh
// bitfield definitions
FSR1H_SHAD_FSR1H_SHAD_POSN               equ 0000h
FSR1H_SHAD_FSR1H_SHAD_POSITION           equ 0000h
FSR1H_SHAD_FSR1H_SHAD_SIZE               equ 0008h
FSR1H_SHAD_FSR1H_SHAD_LENGTH             equ 0008h
FSR1H_SHAD_FSR1H_SHAD_MASK               equ 00FFh

// Register: STKPTR
#define STKPTR STKPTR
STKPTR                                   equ 01FEDh
// bitfield definitions
STKPTR_STKPTR0_POSN                      equ 0000h
STKPTR_STKPTR0_POSITION                  equ 0000h
STKPTR_STKPTR0_SIZE                      equ 0001h
STKPTR_STKPTR0_LENGTH                    equ 0001h
STKPTR_STKPTR0_MASK                      equ 0001h
STKPTR_STKPTR1_POSN                      equ 0001h
STKPTR_STKPTR1_POSITION                  equ 0001h
STKPTR_STKPTR1_SIZE                      equ 0001h
STKPTR_STKPTR1_LENGTH                    equ 0001h
STKPTR_STKPTR1_MASK                      equ 0002h
STKPTR_STKPTR2_POSN                      equ 0002h
STKPTR_STKPTR2_POSITION                  equ 0002h
STKPTR_STKPTR2_SIZE                      equ 0001h
STKPTR_STKPTR2_LENGTH                    equ 0001h
STKPTR_STKPTR2_MASK                      equ 0004h
STKPTR_STKPTR3_POSN                      equ 0003h
STKPTR_STKPTR3_POSITION                  equ 0003h
STKPTR_STKPTR3_SIZE                      equ 0001h
STKPTR_STKPTR3_LENGTH                    equ 0001h
STKPTR_STKPTR3_MASK                      equ 0008h
STKPTR_STKPTR4_POSN                      equ 0004h
STKPTR_STKPTR4_POSITION                  equ 0004h
STKPTR_STKPTR4_SIZE                      equ 0001h
STKPTR_STKPTR4_LENGTH                    equ 0001h
STKPTR_STKPTR4_MASK                      equ 0010h

