garyPenhook/PIC-Assembler/device_includes/pic16f13123.inc
#define ANSC7                            BANKMASK(ANSELC), 7
#define ANSELA0                          BANKMASK(ANSELA), 0
#define ANSELA1                          BANKMASK(ANSELA), 1
#define ANSELA2                          BANKMASK(ANSELA), 2
#define ANSELA4                          BANKMASK(ANSELA), 4
#define ANSELA5                          BANKMASK(ANSELA), 5
#define ANSELC0                          BANKMASK(ANSELC), 0
#define ANSELC1                          BANKMASK(ANSELC), 1
#define ANSELC2                          BANKMASK(ANSELC), 2
#define ANSELC3                          BANKMASK(ANSELC), 3
#define ANSELC4                          BANKMASK(ANSELC), 4
#define ANSELC5                          BANKMASK(ANSELC), 5
#define AOV                              BANKMASK(ADSTAT), 7
#define ASYNC                            BANKMASK(T0CON1), 4
#define BCL1IE                           BANKMASK(PIE5), 3
#define BCL1IF                           BANKMASK(PIR5), 3
#define BF                               BANKMASK(SSP1STAT), 0
#define BF1                              BANKMASK(SSP1STAT), 0
#define BOEN                             BANKMASK(SSP1CON3), 4
#define BORRDY                           BANKMASK(BORCON), 0
#define BRG16                            BANKMASK(BAUD1CON), 3
#define BRGH                             BANKMASK(TX1STA), 2
#define BSR0                             BANKMASK(BSR), 0
#define BSR1                             BANKMASK(BSR), 1
#define BSR2                             BANKMASK(BSR), 2
#define BSR3                             BANKMASK(BSR), 3
#define BSR4                             BANKMASK(BSR), 4
#define BSR5                             BANKMASK(BSR), 5
#define C1EN                             BANKMASK(CM1CON0), 7
#define C1HYS                            BANKMASK(CM1CON0), 1
#define C1INTN                           BANKMASK(CM1CON1), 0
#define C1INTP                           BANKMASK(CM1CON1), 1
#define C1NCH0                           BANKMASK(CM1NCH), 0
#define C1NCH1                           BANKMASK(CM1NCH), 1
#define C1NCH2                           BANKMASK(CM1NCH), 2
#define C1PCH0                           BANKMASK(CM1PCH), 0
#define C1PCH1                           BANKMASK(CM1PCH), 1
#define C1PCH2                           BANKMASK(CM1PCH), 2
#define C1POL                            BANKMASK(CM1CON0), 4
#define C1SP                             BANKMASK(CM1CON0), 2
#define C1SYNC                           BANKMASK(CM1CON0), 0
#define C2EN                             BANKMASK(CM2CON0), 7
#define C2HYS                            BANKMASK(CM2CON0), 1
#define C2INTN                           BANKMASK(CM2CON1), 0
#define C2INTP                           BANKMASK(CM2CON1), 1
#define C2NCH0                           BANKMASK(CM2NCH), 0
#define C2NCH1                           BANKMASK(CM2NCH), 1
#define C2NCH2                           BANKMASK(CM2NCH), 2
#define C2PCH0                           BANKMASK(CM2PCH), 0
#define C2PCH1                           BANKMASK(CM2PCH), 1
#define C2PCH2                           BANKMASK(CM2PCH), 2
#define C2POL                            BANKMASK(CM2CON0), 4
#define C2SP                             BANKMASK(CM2CON0), 2
#define C2SYNC                           BANKMASK(CM2CON0), 0
#define CAL01                            BANKMASK(TMR1L), 0
#define CAL11                            BANKMASK(TMR1L), 1
#define CAL21                            BANKMASK(TMR1L), 2
#define CAL31                            BANKMASK(TMR1L), 3
#define CAL41                            BANKMASK(TMR1L), 4
#define CAL51                            BANKMASK(TMR1L), 5
#define CAL61                            BANKMASK(TMR1L), 6
#define CAL71                            BANKMASK(TMR1L), 7
#define CALC0                            BANKMASK(ADCON3), 4
#define CALC1                            BANKMASK(ADCON3), 5
#define CALC2                            BANKMASK(ADCON3), 6
#define CARRY                            BANKMASK(STATUS), 0
#define CCP1CTS0                         BANKMASK(CCP1CAP), 0
#define CCP1CTS1                         BANKMASK(CCP1CAP), 1
#define CCP1CTS2                         BANKMASK(CCP1CAP), 2
#define CCP1CTS3                         BANKMASK(CCP1CAP), 3
#define CCP1EN                           BANKMASK(CCP1CON), 7
#define CCP1FMT                          BANKMASK(CCP1CON), 4
#define CCP1IE                           BANKMASK(PIE2), 5
#define CCP1IF                           BANKMASK(PIR2), 5
#define CCP1MD                           BANKMASK(PMD1), 5
#define CCP1MODE0                        BANKMASK(CCP1CON), 0
#define CCP1MODE1                        BANKMASK(CCP1CON), 1
#define CCP1MODE2                        BANKMASK(CCP1CON), 2
#define CCP1MODE3                        BANKMASK(CCP1CON), 3
#define CCP1OUT                          BANKMASK(CCP1CON), 5
#define CCP1PPS0                         BANKMASK(CCP1PPS), 0
#define CCP1PPS1                         BANKMASK(CCP1PPS), 1
#define CCP1PPS2                         BANKMASK(CCP1PPS), 2
#define CCP1PPS3                         BANKMASK(CCP1PPS), 3
#define CCP1PPS4                         BANKMASK(CCP1PPS), 4
#define CCP2CTS0                         BANKMASK(CCP2CAP), 0
#define CCP2CTS1                         BANKMASK(CCP2CAP), 1
#define CCP2CTS2                         BANKMASK(CCP2CAP), 2
#define CCP2CTS3                         BANKMASK(CCP2CAP), 3
#define CCP2EN                           BANKMASK(CCP2CON), 7
#define CCP2FMT                          BANKMASK(CCP2CON), 4
#define CCP2IE                           BANKMASK(PIE2), 6
#define CCP2IF                           BANKMASK(PIR2), 6
#define CCP2MD                           BANKMASK(PMD1), 6
#define CCP2MODE0                        BANKMASK(CCP2CON), 0
#define CCP2MODE1                        BANKMASK(CCP2CON), 1
#define CCP2MODE2                        BANKMASK(CCP2CON), 2
#define CCP2MODE3                        BANKMASK(CCP2CON), 3
#define CCP2OUT                          BANKMASK(CCP2CON), 5
#define CCP2PPS0                         BANKMASK(CCP2PPS), 0
#define CCP2PPS1                         BANKMASK(CCP2PPS), 1
#define CCP2PPS2                         BANKMASK(CCP2PPS), 2
#define CCP2PPS3                         BANKMASK(CCP2PPS), 3
#define CCP2PPS4                         BANKMASK(CCP2PPS), 4
#define CDAFVR0                          BANKMASK(FVRCON), 2
#define CDAFVR1                          BANKMASK(FVRCON), 3
#define CDIV0                            BANKMASK(OSCCON2), 0
#define CDIV1                            BANKMASK(OSCCON2), 1
#define CDIV2                            BANKMASK(OSCCON2), 2
#define CDIV3                            BANKMASK(OSCCON2), 3
#define CGA0                             BANKMASK(ADCG1A), 0
#define CGA1                             BANKMASK(ADCG1A), 1
#define CGA2                             BANKMASK(ADCG1A), 2
#define CGA4                             BANKMASK(ADCG1A), 4
#define CGA5                             BANKMASK(ADCG1A), 5
#define CGC0                             BANKMASK(ADCG1C), 0
#define CGC1                             BANKMASK(ADCG1C), 1
#define CGC2                             BANKMASK(ADCG1C), 2
#define CGC3                             BANKMASK(ADCG1C), 3
#define CGC4                             BANKMASK(ADCG1C), 4
#define CGC5                             BANKMASK(ADCG1C), 5
#define CKE                              BANKMASK(SSP1STAT), 6
#define CKE1                             BANKMASK(SSP1STAT), 6
#define CKP                              BANKMASK(SSP1CON1), 4
#define CKP1                             BANKMASK(SSP1CON1), 4
#define CKPOL                            BANKMASK(T2HLT), 6
#define CKPS3                            BANKMASK(T0CON1), 3
#define CKSYNC                           BANKMASK(T2HLT), 5
#define CLB1IE0                          BANKMASK(PIE7), 0
#define CLB1IE1                          BANKMASK(PIE7), 1
#define CLB1IE2                          BANKMASK(PIE7), 2
#define CLB1IE3                          BANKMASK(PIE7), 3
#define CLB1IF0                          BANKMASK(PIR7), 0
#define CLB1IF1                          BANKMASK(PIR7), 1
#define CLB1IF2                          BANKMASK(PIR7), 2
#define CLB1IF3                          BANKMASK(PIR7), 3
#define CLBEN                            BANKMASK(CLBCON), 7
#define CLBMD                            BANKMASK(PMD4), 7
#define CLBSWIN0                         BANKMASK(CLBSWINL), 0
#define CLBSWIN1                         BANKMASK(CLBSWINL), 1
#define CLBSWIN10                        BANKMASK(CLBSWINM), 2
#define CLBSWIN11                        BANKMASK(CLBSWINM), 3
#define CLBSWIN12                        BANKMASK(CLBSWINM), 4
#define CLBSWIN13                        BANKMASK(CLBSWINM), 5
#define CLBSWIN14                        BANKMASK(CLBSWINM), 6
#define CLBSWIN15                        BANKMASK(CLBSWINM), 7
#define CLBSWIN16                        BANKMASK(CLBSWINH), 0
#define CLBSWIN17                        BANKMASK(CLBSWINH), 1
#define CLBSWIN18                        BANKMASK(CLBSWINH), 2
#define CLBSWIN19                        BANKMASK(CLBSWINH), 3
#define CLBSWIN2                         BANKMASK(CLBSWINL), 2
#define CLBSWIN20                        BANKMASK(CLBSWINH), 4
#define CLBSWIN21                        BANKMASK(CLBSWINH), 5
#define CLBSWIN22                        BANKMASK(CLBSWINH), 6
#define CLBSWIN23                        BANKMASK(CLBSWINH), 7
#define CLBSWIN24                        BANKMASK(CLBSWINU), 0
#define CLBSWIN25                        BANKMASK(CLBSWINU), 1
#define CLBSWIN26                        BANKMASK(CLBSWINU), 2
#define CLBSWIN27                        BANKMASK(CLBSWINU), 3
#define CLBSWIN28                        BANKMASK(CLBSWINU), 4
#define CLBSWIN29                        BANKMASK(CLBSWINU), 5
#define CLBSWIN3                         BANKMASK(CLBSWINL), 3
#define CLBSWIN30                        BANKMASK(CLBSWINU), 6
#define CLBSWIN31                        BANKMASK(CLBSWINU), 7
#define CLBSWIN4                         BANKMASK(CLBSWINL), 4
#define CLBSWIN5                         BANKMASK(CLBSWINL), 5
#define CLBSWIN6                         BANKMASK(CLBSWINL), 6
#define CLBSWIN7                         BANKMASK(CLBSWINL), 7
#define CLBSWIN8                         BANKMASK(CLBSWINM), 0
#define CLBSWIN9                         BANKMASK(CLBSWINM), 1
#define CLC1IE                           BANKMASK(PIE4), 2
#define CLC1IF                           BANKMASK(PIR4), 2
#define CLC1MD                           BANKMASK(PMD2), 5
#define CLC1OUT                          BANKMASK(CLCDATA), 0
#define CLC2IE                           BANKMASK(PIE4), 3
#define CLC2IF                           BANKMASK(PIR4), 3
#define CLC2MD                           BANKMASK(PMD2), 6
#define CLC2OUT                          BANKMASK(CLCDATA), 1
#define CLC3IE                           BANKMASK(PIE4), 4
#define CLC3IF                           BANKMASK(PIR4), 4
#define CLC3MD                           BANKMASK(PMD2), 7
#define CLC3OUT                          BANKMASK(CLCDATA), 2
#define CLC4IE                           BANKMASK(PIE4), 5
#define CLC4IF                           BANKMASK(PIR4), 5
#define CLC4MD                           BANKMASK(PMD3), 0
#define CLC4OUT                          BANKMASK(CLCDATA), 3
#define CLCIN0PPS0                       BANKMASK(CLCIN0PPS), 0
#define CLCIN0PPS1                       BANKMASK(CLCIN0PPS), 1
#define CLCIN0PPS2                       BANKMASK(CLCIN0PPS), 2
#define CLCIN0PPS3                       BANKMASK(CLCIN0PPS), 3
#define CLCIN0PPS4                       BANKMASK(CLCIN0PPS), 4
#define CLCIN1PPS0                       BANKMASK(CLCIN1PPS), 0
#define CLCIN1PPS1                       BANKMASK(CLCIN1PPS), 1
#define CLCIN1PPS2                       BANKMASK(CLCIN1PPS), 2
#define CLCIN1PPS3                       BANKMASK(CLCIN1PPS), 3
#define CLCIN1PPS4                       BANKMASK(CLCIN1PPS), 4
#define CLCIN2PPS0                       BANKMASK(CLCIN2PPS), 0
#define CLCIN2PPS1                       BANKMASK(CLCIN2PPS), 1
#define CLCIN2PPS2                       BANKMASK(CLCIN2PPS), 2
#define CLCIN2PPS3                       BANKMASK(CLCIN2PPS), 3
#define CLCIN2PPS4                       BANKMASK(CLCIN2PPS), 4
#define CLCIN3PPS0                       BANKMASK(CLCIN3PPS), 0
#define CLCIN3PPS1                       BANKMASK(CLCIN3PPS), 1
#define CLCIN3PPS2                       BANKMASK(CLCIN3PPS), 2
#define CLCIN3PPS3                       BANKMASK(CLCIN3PPS), 3
#define CLCIN3PPS4                       BANKMASK(CLCIN3PPS), 4
#define CLK0                             BANKMASK(CLBCLK), 0
#define CLK1                             BANKMASK(CLBCLK), 1
#define CLK2                             BANKMASK(CLBCLK), 2
#define CLK3                             BANKMASK(CLBCLK), 3
#define CM1IE                            BANKMASK(PIE5), 6
#define CM1IF                            BANKMASK(PIR5), 6
#define CM1MD                            BANKMASK(PMD3), 6
#define CM2IE                            BANKMASK(PIE5), 7
#define CM2IF                            BANKMASK(PIR5), 7
#define CM2MD                            BANKMASK(PMD3), 7
#define CNT0                             BANKMASK(ADCNT), 0
#define CNT1                             BANKMASK(ADCNT), 1
#define CNT2                             BANKMASK(ADCNT), 2
#define CNT3                             BANKMASK(ADCNT), 3
#define CNT4                             BANKMASK(ADCNT), 4
#define CNT5                             BANKMASK(ADCNT), 5
#define CNT6                             BANKMASK(ADCNT), 6
#define CNT7                             BANKMASK(ADCNT), 7
#define CONT                             BANKMASK(ADCON0), 6
#define COSC0                            BANKMASK(OSCCON2), 4
#define COSC1                            BANKMASK(OSCCON2), 5
#define COSC2                            BANKMASK(OSCCON2), 6
#define CPOL                             BANKMASK(T2HLT), 6
#define CPOS                             BANKMASK(CPCON), 5
#define CPRDY                            BANKMASK(CPCON), 0
#define CPREQ                            BANKMASK(CPCON), 2
#define CPT                              BANKMASK(CPCON), 1
#define CRCBUSY                          BANKMASK(CRCCON0), 5
#define CRCEN                            BANKMASK(CRCCON0), 7
#define CRCGO                            BANKMASK(CRCCON0), 6
#define CRCIE                            BANKMASK(PIE1), 1
#define CRCIF                            BANKMASK(PIR1), 1
#define CRCMD                            BANKMASK(PMD0), 1
#define CREN                             BANKMASK(RC1STA), 4
#define CRS0                             BANKMASK(ADCON2), 4
#define CRS1                             BANKMASK(ADCON2), 5
#define CRS2                             BANKMASK(ADCON2), 6
#define CS                               BANKMASK(ADCON0), 4
#define CS5                              BANKMASK(ADCLK), 5
#define CSRC                             BANKMASK(TX1STA), 7
#define CSWHOLD                          BANKMASK(OSCCON3), 7
#define CSWIE                            BANKMASK(PIE1), 4
#define CSWIF                            BANKMASK(PIR1), 4
#define CSYNC                            BANKMASK(T2HLT), 5
#define D1S0                             BANKMASK(CLCnSEL0), 0
#define D1S1                             BANKMASK(CLCnSEL0), 1
#define D1S2                             BANKMASK(CLCnSEL0), 2
#define D1S3                             BANKMASK(CLCnSEL0), 3
#define D1S4                             BANKMASK(CLCnSEL0), 4
#define D1S5                             BANKMASK(CLCnSEL0), 5
#define D1S6                             BANKMASK(CLCnSEL0), 6
#define D2S0                             BANKMASK(CLCnSEL1), 0
#define D2S1                             BANKMASK(CLCnSEL1), 1
#define D2S2                             BANKMASK(CLCnSEL1), 2
#define D2S3                             BANKMASK(CLCnSEL1), 3
#define D2S4                             BANKMASK(CLCnSEL1), 4
#define D2S5                             BANKMASK(CLCnSEL1), 5
#define D2S6                             BANKMASK(CLCnSEL1), 6
#define D3S0                             BANKMASK(CLCnSEL2), 0
#define D3S1                             BANKMASK(CLCnSEL2), 1
#define D3S2                             BANKMASK(CLCnSEL2), 2
#define D3S3                             BANKMASK(CLCnSEL2), 3
#define D3S4                             BANKMASK(CLCnSEL2), 4
#define D3S5                             BANKMASK(CLCnSEL2), 5
#define D3S6                             BANKMASK(CLCnSEL2), 6
#define D4S0                             BANKMASK(CLCnSEL3), 0
#define D4S1                             BANKMASK(CLCnSEL3), 1
#define D4S2                             BANKMASK(CLCnSEL3), 2
#define D4S3                             BANKMASK(CLCnSEL3), 3
#define D4S4                             BANKMASK(CLCnSEL3), 4
#define D4S5                             BANKMASK(CLCnSEL3), 5
#define D4S6                             BANKMASK(CLCnSEL3), 6
#define DA                               BANKMASK(SSP1STAT), 5
#define DA1                              BANKMASK(SSP1STAT), 5
#define DABORT                           BANKMASK(SCANCON0), 4
#define DAC1MD                           BANKMASK(PMD4), 1
#define DATA0                            BANKMASK(CRCDATAL), 0
#define DATA1                            BANKMASK(CRCDATAL), 1
#define DATA10                           BANKMASK(CRCDATAH), 2
#define DATA11                           BANKMASK(CRCDATAH), 3
#define DATA12                           BANKMASK(CRCDATAH), 4
#define DATA13                           BANKMASK(CRCDATAH), 5
#define DATA14                           BANKMASK(CRCDATAH), 6
#define DATA15                           BANKMASK(CRCDATAH), 7
#define DATA16                           BANKMASK(CRCDATAU), 0
#define DATA17                           BANKMASK(CRCDATAU), 1
#define DATA18                           BANKMASK(CRCDATAU), 2
#define DATA19                           BANKMASK(CRCDATAU), 3
#define DATA2                            BANKMASK(CRCDATAL), 2
#define DATA20                           BANKMASK(CRCDATAU), 4
#define DATA21                           BANKMASK(CRCDATAU), 5
#define DATA22                           BANKMASK(CRCDATAU), 6
#define DATA23                           BANKMASK(CRCDATAU), 7
#define DATA24                           BANKMASK(CRCDATAT), 0
#define DATA25                           BANKMASK(CRCDATAT), 1
#define DATA26                           BANKMASK(CRCDATAT), 2
#define DATA27                           BANKMASK(CRCDATAT), 3
#define DATA28                           BANKMASK(CRCDATAT), 4
#define DATA29                           BANKMASK(CRCDATAT), 5
#define DATA3                            BANKMASK(CRCDATAL), 3
#define DATA30                           BANKMASK(CRCDATAT), 6
#define DATA31                           BANKMASK(CRCDATAT), 7
#define DATA4                            BANKMASK(CRCDATAL), 4
#define DATA5                            BANKMASK(CRCDATAL), 5
#define DATA6                            BANKMASK(CRCDATAL), 6
#define DATA7                            BANKMASK(CRCDATAL), 7
#define DATA8                            BANKMASK(CRCDATAH), 0
#define DATA9                            BANKMASK(CRCDATAH), 1
#define DATA_ADDRESS                     BANKMASK(SSP1STAT), 5
#define DATA_ADDRESS1                    BANKMASK(SSP1STAT), 5
#define DC                               BANKMASK(STATUS), 1
#define DHEN                             BANKMASK(SSP1CON3), 0
#define DLEN0                            BANKMASK(CRCCON2), 0
#define DLEN1                            BANKMASK(CRCCON2), 1
#define DLEN2                            BANKMASK(CRCCON2), 2
#define DLEN3                            BANKMASK(CRCCON2), 3
#define DLEN4                            BANKMASK(CRCCON2), 4
#define DOE                              BANKMASK(CPUDOZE), 4
#define DONE                             BANKMASK(ADCON0), 0
#define DOZEN                            BANKMASK(CPUDOZE), 6
#define DPS                              BANKMASK(SCANDPS), 0
#define DSEN                             BANKMASK(ADCON1), 0
#define D_A                              BANKMASK(SSP1STAT), 5
#define D_A1                             BANKMASK(SSP1STAT), 5
#define D_nA                             BANKMASK(SSP1STAT), 5
#define D_nA1                            BANKMASK(SSP1STAT), 5
#define ERR0                             BANKMASK(ADERRL), 0
#define ERR1                             BANKMASK(ADERRL), 1
#define ERR10                            BANKMASK(ADERRH), 2
#define ERR11                            BANKMASK(ADERRH), 3
#define ERR12                            BANKMASK(ADERRH), 4
#define ERR13                            BANKMASK(ADERRH), 5
#define ERR14                            BANKMASK(ADERRH), 6
#define ERR15                            BANKMASK(ADERRH), 7
#define ERR2                             BANKMASK(ADERRL), 2
#define ERR3                             BANKMASK(ADERRL), 3
#define ERR4                             BANKMASK(ADERRL), 4
#define ERR5                             BANKMASK(ADERRL), 5
#define ERR6                             BANKMASK(ADERRL), 6
#define ERR7                             BANKMASK(ADERRL), 7
#define ERR8                             BANKMASK(ADERRH), 0
#define ERR9                             BANKMASK(ADERRH), 1
#define EXTOEN                           BANKMASK(OSCEN), 7
#define EXTOR                            BANKMASK(OSCSTAT), 7
#define FERR                             BANKMASK(RC1STA), 2
#define FLTR0                            BANKMASK(ADFLTRL), 0
#define FLTR1                            BANKMASK(ADFLTRL), 1
#define FLTR10                           BANKMASK(ADFLTRH), 2
#define FLTR11                           BANKMASK(ADFLTRH), 3
#define FLTR12                           BANKMASK(ADFLTRH), 4
#define FLTR13                           BANKMASK(ADFLTRH), 5
#define FLTR14                           BANKMASK(ADFLTRH), 6
#define FLTR15                           BANKMASK(ADFLTRH), 7
#define FLTR2                            BANKMASK(ADFLTRL), 2
#define FLTR3                            BANKMASK(ADFLTRL), 3
#define FLTR4                            BANKMASK(ADFLTRL), 4
#define FLTR5                            BANKMASK(ADFLTRL), 5
#define FLTR6                            BANKMASK(ADFLTRL), 6
#define FLTR7                            BANKMASK(ADFLTRL), 7
#define FLTR8                            BANKMASK(ADFLTRH), 0
#define FLTR9                            BANKMASK(ADFLTRH), 1
#define FM0                              BANKMASK(ADCON0), 2
#define FREE                             BANKMASK(NVMCON1), 4
#define FRQ0                             BANKMASK(OSCFRQ), 0
#define FRQ1                             BANKMASK(OSCFRQ), 1
#define FRQ2                             BANKMASK(OSCFRQ), 2
#define FULL                             BANKMASK(CRCCON0), 0
#define FVREN                            BANKMASK(FVRCON), 7
#define FVRMD                            BANKMASK(PMD3), 5
#define FVRRDY                           BANKMASK(FVRCON), 6
#define G1D1N                            BANKMASK(CLCnGLS0), 0
#define G1D1T                            BANKMASK(CLCnGLS0), 1
#define G1D2N                            BANKMASK(CLCnGLS0), 2
#define G1D2T                            BANKMASK(CLCnGLS0), 3
#define G1D3N                            BANKMASK(CLCnGLS0), 4
#define G1D3T                            BANKMASK(CLCnGLS0), 5
#define G1D4N                            BANKMASK(CLCnGLS0), 6
#define G1D4T                            BANKMASK(CLCnGLS0), 7
#define G1POL                            BANKMASK(CLCnPOL), 0
#define G2D1N                            BANKMASK(CLCnGLS1), 0
#define G2D1T                            BANKMASK(CLCnGLS1), 1
#define G2D2N                            BANKMASK(CLCnGLS1), 2
#define G2D2T                            BANKMASK(CLCnGLS1), 3
